'''
===================================================================================================================================
문제
===================================================================================================================================
소수 찾기 ☆☆
===================================================================================================================================
문제 설명
===================================================================================================================================
' 한자리 숫자가 적힌 종이 조각이 흩어져있습니다. 흩어진 종이 조각을 붙여 소수를 몇 개 만들 수 있는지 알아내려 합니다.

' 각 종이 조각에 적힌 숫자가 적힌 문자열 numbers가 주어졌을 때, 종이 조각으로 만들 수 있는 소수가 몇 개인지 return 하도록 solution 함수를
  완성해주세요.
===================================================================================================================================
제한 조건
===================================================================================================================================
' numbers는 길이 1 이상 7 이하인 문자열입니다.
' numbers는 0~9까지 숫자만으로 이루어져 있습니다.
' "013"은 0, 1, 3 숫자가 적힌 종이 조각이 흩어져있다는 의미입니다.
===================================================================================================================================
입출력 예
===================================================================================================================================
numbers return
"17"    3
"011"   2
===================================================================================================================================
입출력 예 설명
===================================================================================================================================
' 입출력 예 #1
    [1, 7]으로는 소수 [7, 17, 71]를 만들 수 있습니다.

' 입출력 예 #2
    [0, 1, 1]으로는 소수 [11, 101]를 만들 수 있습니다.
    11과 011은 같은 숫자로 취급합니다.
===================================================================================================================================
Log
===================================================================================================================================
2021-11-18-Thu : 문제 파악
                 문제 해결
===================================================================================================================================
'''

def solution(numbers):
    answer = 0
    # 숫자 리스트 만들기
    num = list(numbers)
    temp = ''
    i = 0
    while True:
        # num[i]의 길이가 len(numbers)-1과 같거나 작으면
        if len(num[i]) <= len(numbers) - 1:
            if i == 0:
                for j in range(1, len(numbers)):
                    if numbers[i] + numbers[j] not in num:
                        num.append(numbers[i] + numbers[j])
            if i == len(numbers) - 1:
                for j in range(len(numbers) - 1):
                    if numbers[i] + numbers[j] not in num:
                        num.append(numbers[i] + numbers[j])
            else:
                if i < len(numbers):
                    for j in range(i):
                        if numbers[i] + numbers[j] not in num:
                            num.append(numbers[i] + numbers[j])
                    for j in range(i+1, len(numbers)):
                        if numbers[i] + numbers[j] not in num:
                            num.append(numbers[i] + numbers[j])
                else:
                    temp = list(numbers)
                    # temp에서 num[i]에 있는 숫자 모두 제거
                    for j in num[i]:
                        if j in temp:
                            temp.remove(j)
                    # temp의 길이만큼 num[i] 뒤에 붙이기
                    for j in temp:
                        if num[i] + j not in num:
                            num.append(num[i] + j)
        if i == len(num) - 1:
            break
        i += 1

    # 소수 판별
    num = list(set(map(int, num)))
    for i in num:
        count = 0
        for j in range(2, i//2+1):
            if i % j == 0:
                break
            else:
                count += 1
        if count == i//2 - 1:
            answer += 1
    return answer

print(solution("17")) # 3
print(solution("011")) # 2